In [1]:
import pandas as pd
import numpy as np

# Recreate the employees data
employees_data = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'first_name': ['Ana', 'Ben', 'Cara', 'Dave', 'Ella', 'Frank', 'Grace', 'Henry', 'Iris', 'Jack'],
    'last_name': ['Gonzalez', 'Nguyen', 'Ivanova', 'Okafor', 'Schmidt', 'Chen', 'Williams', 'Johnson', 'Patel', 'Brown'],
    'dept': ['Sales', 'Marketing', 'Tech', 'Tech', 'HR', None, None, 'Finance', 'Tech', 'Sales'],
    'salary': [68000, 72000, 98000, 105000, 60000, 55000, 62000, 75000, 88000, None],
    'manager_id': [None, 1, 4, 4, 1, 1, 1, 10, 4, None],
    'hire_date': ['2015-01-10', '2018-06-22', '2022-03-15', '2017-11-05', '2019-09-01', 
                  '2020-12-12', '2023-04-18', '2016-07-03', '2023-01-09', '2021-05-20']
}

employees = pd.DataFrame(employees_data)

departments = pd.DataFrame({
    'dname': ['Tech', 'Sales', 'HR', 'Marketing', 'Legal', 'R&D'],
    'loc': ['Building A', 'Building B', 'Building C', 'Building B', 'Building D', 'Building A'],
    'budget': [500000, 300000, 150000, 250000, 200000, 450000]
})

In [2]:
SELECT dept, salary
FROM (
    SELECT dept, salary,
           ROW_NUMBER() OVER (PARTITION BY dept ORDER BY salary DESC) as rn
    FROM employees
    WHERE salary IS NOT NULL
) ranked
WHERE rn = 2;

SyntaxError: invalid syntax (1713819102.py, line 1)

In [35]:
rn = employees[['dept', 'salary']] # dataframe
rn = rn[rn['salary'].notna()] # filtered dataframe
rn = rn.sort_values(['dept', 'salary'], ascending=[True, False]).groupby('dept')['salary'] # grouped object after sorting
rn.nth(1)

2    98000.0
Name: salary, dtype: float64

In [36]:
SELECT e.first_name, e.last_name, e.salary, e.dept
FROM employees e
JOIN (
    SELECT dept, MAX(salary) * 0.9 as min_threshold
    FROM employees
    WHERE salary IS NOT NULL
    GROUP BY dept
) thresholds ON e.dept = thresholds.dept
WHERE e.salary >= thresholds.min_threshold;

SyntaxError: invalid syntax (3245519767.py, line 1)

In [72]:
df2 = employees[['first_name', 'last_name', 'dept', 'salary']] # select columns
df2 = df2[df2['salary'].notna() & df2['dept'].notna()] # filter nulls
df3 = df2.groupby('dept')['salary'].agg('max'); # group by dept and salary, calculate max.
df2 = df2.merge(df3, on='dept')
df2 = df2[df2['salary_x'] >= 0.9 * df2['salary_y']]
df2

  first_name last_name       dept  salary_x  salary_y
0        Ana  Gonzalez      Sales   68000.0   68000.0
1        Ben    Nguyen  Marketing   72000.0   72000.0
2       Cara   Ivanova       Tech   98000.0  105000.0
3       Dave    Okafor       Tech  105000.0  105000.0
4       Ella   Schmidt         HR   60000.0   60000.0
5      Henry   Johnson    Finance   75000.0   75000.0

In [73]:
SELECT DISTINCT e1.first_name, e1.last_name, e1.salary, e1.dept
FROM employees e1
JOIN employees e2 ON e1.salary = e2.salary AND e1.dept != e2.dept
WHERE e1.salary IS NOT NULL;

SyntaxError: invalid syntax (2366865318.py, line 1)

In [101]:
emp_filtered = employees[['first_name','last_name', 'salary', 'dept']].dropna()
emp2 = emp_filtered
merged = emp_filtered.merge(emp2, on='salary')
merged = merged[merged['dept_x'] != merged['dept_y']]
merged

Empty DataFrame
Columns: [first_name_x, last_name_x, salary, dept_x, first_name_y, last_name_y, dept_y]
Index: []

In [102]:
emp_filtered = employees[['first_name','last_name', 'salary', 'dept']].dropna()
emp2 = emp_filtered
merged = emp_filtered.merge(emp2, on='salary')
merged = merged[merged['dept_x'] != merged['dept_y']]
merged

Empty DataFrame
Columns: [first_name_x, last_name_x, salary, dept_x, first_name_y, last_name_y, dept_y]
Index: []

In [103]:
SELECT dept, COUNT(*) as employee_count
FROM employees
WHERE dept IS NOT NULL
GROUP BY dept
ORDER BY employee_count DESC
LIMIT 1;

SyntaxError: invalid syntax (2481188206.py, line 1)

In [119]:
emp_depts = employees.groupby('dept')['id'].agg('count')
emp_depts = emp_depts.sort_values(ascending=False)
emp_depts.head(1)

dept
Tech    3
Name: id, dtype: int64

In [120]:
SELECT e.first_name, e.last_name, e.dept, e.hire_date
FROM employees e
JOIN (
    SELECT dept, MIN(hire_date) as earliest_date
    FROM employees
    WHERE dept IS NOT NULL
    GROUP BY dept
) earliest ON e.dept = earliest.dept AND e.hire_date = earliest.earliest_date;

SyntaxError: invalid syntax (4060245811.py, line 1)

In [149]:
emp_gr = employees[['first_name', 'last_name', 'dept', 'hire_date']]
emp2 = emp_gr
emp_gr = emp_gr[emp_gr['dept'].notna()]
emp_gr = emp_gr.groupby('dept')['hire_date'].agg('min').reset_index()
emp2 = emp2.merge(emp_gr, on=['dept','hire_date'])
emp2

  first_name last_name       dept   hire_date
0        Ana  Gonzalez      Sales  2015-01-10
1        Ben    Nguyen  Marketing  2018-06-22
2       Dave    Okafor       Tech  2017-11-05
3       Ella   Schmidt         HR  2019-09-01
4      Henry   Johnson    Finance  2016-07-03

In [150]:
import pandas as pd
import numpy as np

# Recreate the employees data
employees_data = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'first_name': ['Ana', 'Ben', 'Cara', 'Dave', 'Ella', 'Frank', 'Grace', 'Henry', 'Iris', 'Jack'],
    'last_name': ['Gonzalez', 'Nguyen', 'Ivanova', 'Okafor', 'Schmidt', 'Chen', 'Williams', 'Johnson', 'Patel', 'Brown'],
    'dept': ['Sales', 'Marketing', 'Tech', 'Tech', 'HR', None, None, 'Finance', 'Tech', 'Sales'],
    'salary': [68000, 72000, 98000, 105000, 60000, 55000, 62000, 75000, 88000, None],
    'manager_id': [None, 1, 4, 4, 1, 1, 1, 10, 4, None],
    'hire_date': ['2015-01-10', '2018-06-22', '2022-03-15', '2017-11-05', '2019-09-01', 
                  '2020-12-12', '2023-04-18', '2016-07-03', '2023-01-09', '2021-05-20']
}

employees = pd.DataFrame(employees_data)

departments = pd.DataFrame({
    'dname': ['Tech', 'Sales', 'HR', 'Marketing', 'Legal', 'R&D'],
    'loc': ['Building A', 'Building B', 'Building C', 'Building B', 'Building D', 'Building A'],
    'budget': [500000, 300000, 150000, 250000, 200000, 450000]
})

In [151]:
SELECT first_name, last_name, dept, hire_date,
       EXTRACT(YEAR FROM AGE('2025-07-15', hire_date)) as years_employed
FROM employees
WHERE EXTRACT(YEAR FROM AGE('2025-07-15', hire_date)) >= 5
ORDER BY hire_date;

SyntaxError: invalid syntax (1886858045.py, line 1)

In [194]:
emp = employees[['first_name', 'last_name', 'hire_date']].copy()
today = pd.Timestamp('2025-07-15')
emp['years_hired'] = round((today - pd.to_datetime(emp['hire_date'])).dt.days / 365)
filtered = emp[emp['years_hired'] >= 5]
filtered

  first_name last_name   hire_date  years_hired
0        Ana  Gonzalez  2015-01-10         11.0
1        Ben    Nguyen  2018-06-22          7.0
3       Dave    Okafor  2017-11-05          8.0
4       Ella   Schmidt  2019-09-01          6.0
5      Frank      Chen  2020-12-12          5.0
7      Henry   Johnson  2016-07-03          9.0

In [195]:
SELECT d.dname, 
       COALESCE(AVG(e.salary), 0) as avg_salary,
       COUNT(e.id) as employee_count
FROM departments d
LEFT JOIN employees e ON d.dname = e.dept AND e.salary IS NOT NULL
GROUP BY d.dname
ORDER BY avg_salary DESC;

SyntaxError: invalid syntax (3554843771.py, line 1)

In [241]:
depts = departments[departments['dname'].notna()]
emps = employees[['dept','salary', 'id']].groupby('dept').agg({'salary': 'mean','id' : 'count'})
depts = depts.merge(emps, left_on='dname', right_on='dept', how='left').fillna(0)
depts.sort_values(by='salary', ascending=False)

       dname         loc  budget   salary   id
0       Tech  Building A  500000  97000.0  3.0
3  Marketing  Building B  250000  72000.0  1.0
1      Sales  Building B  300000  68000.0  2.0
2         HR  Building C  150000  60000.0  1.0
4      Legal  Building D  200000      0.0  0.0
5        R&D  Building A  450000      0.0  0.0

In [242]:
SELECT e.first_name, e.last_name, e.salary, e.dept
FROM employees e
JOIN (
    SELECT dept, 
           PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY salary) as median_salary
    FROM employees
    WHERE salary IS NOT NULL
    GROUP BY dept
) medians ON e.dept = medians.dept
WHERE e.salary > medians.median_salary;

SyntaxError: invalid syntax (4256003042.py, line 1)

In [324]:
emp = employees[['first_name', 'last_name', 'dept', 'salary']].copy()
emp = emp[emp['salary'].notna()]
emppie = emp.groupby('dept')['salary'].agg('median')
df = emppie.to_frame().reset_index()
emp = emp.merge(df, on='dept')
final = emp[emp['salary_x'] > emp['salary_y']]
final

  first_name last_name  dept  salary_x  salary_y
3       Dave    Okafor  Tech  105000.0   98000.0

In [326]:
emp = employees[['first_name', 'last_name', 'dept', 'salary']].copy()
#skip np.where, just filter nulls directly.
emp = emp[emp['salary'].notna()]

# Calculate median per department
dept_medians = emp.groupby('dept')['salary'].median()

# Merge back with employee data
result = emp.merge(dept_medians, left_on='dept', right_index=True, suffixes=('', '_median'))

final = result[result['salary'] > result['salary_median']]
final

  first_name last_name  dept    salary  salary_median
3       Dave    Okafor  Tech  105000.0        98000.0

In [327]:
Find the top 2 highest-paid employees in each department.
SELECT first_name, last_name, dept, salary
FROM (
    SELECT first_name, last_name, dept, salary,
           ROW_NUMBER() OVER (PARTITION BY dept ORDER BY salary DESC) as rn
    FROM employees
    WHERE salary IS NOT NULL
) ranked
WHERE rn <= 2
ORDER BY dept, salary DESC;

SyntaxError: invalid syntax (2287929693.py, line 1)

In [351]:
emp = employees[['first_name', 'last_name', 'dept', 'salary']]
emp = emp[emp['salary'].notna()]
emp = emp.sort_values(['dept', 'salary']).groupby('dept')
emp.head(2)

  first_name last_name       dept   salary
7      Henry   Johnson    Finance  75000.0
4       Ella   Schmidt         HR  60000.0
1        Ben    Nguyen  Marketing  72000.0
0        Ana  Gonzalez      Sales  68000.0
8       Iris     Patel       Tech  88000.0
2       Cara   Ivanova       Tech  98000.0

In [352]:
SELECT DISTINCT e1.first_name, e1.last_name, e1.dept, e1.manager_id
FROM employees e1
JOIN employees e2 ON e1.manager_id = e2.manager_id 
                  AND e1.dept != e2.dept
                  AND e1.id != e2.id
WHERE e1.manager_id IS NOT NULL
ORDER BY e1.manager_id, e1.dept;

SyntaxError: invalid syntax (3143280510.py, line 1)

In [379]:
e1 = employees[['first_name', 'last_name', 'dept', 'manager_id', 'id']]
e1 = e1[e1['manager_id'].notna() & e1['dept'].notna()]
e2 = e1.copy()
result = e1.merge(e2, on='manager_id', suffixes=['_e1', '_e2'])
result = result[(result['dept_e1'] != result['dept_e2']) & (result['id_e1'] != result['id_e2'])]
result

,first_name_e1,last_name_e1,dept_e1,manager_id,id_e1,first_name_e2,last_name_e2,dept_e2,id_e2
1,Ben,Nguyen,Marketing,1.0,2,Ella,Schmidt,HR,5
8,Ella,Schmidt,HR,1.0,5,Ben,Nguyen,Marketing,2